{"jobs":[{"company_name":"AltspaceVR","description":"We need design-minded front end developers with deep knowledge of modern web development to create next generation user interfaces. We are leveraging a Chromium integration paired with powerful VR APIs to present web apps in holographic 3D to devices like the Oculus Rift and HTC Vive. Forget supporting IE. With us you'd be programming against HUDs, non-rectangular displays, and holographic projectors.  \r\n\r\n[See more about AltspaceVR](https://www.youtube.com/watch?v=CQtQGoMRXaI) \r\n\r\nWe are:  \r\n\r\n- A virtual reality software company [https://twitter.com/AltspaceVR](https://twitter.com/AltspaceVR)  \r\n- Backed by some of the best investors on the planet [http://altvr.com/about/](http://altvr.com/about/)  \r\n- A team that is passionate about the future of VR  [http://altvr.com/team/](http://altvr.com/team/)  \r\n\r\n**[Apply!](https://jobs.lever.co/altspace/9761fb55-6bf5-4d49-852d-6ad9b09154eb)**","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Virtual Reality Front End UI Engineer","url":"http://codepen.io/url/job/zXbOpr","hashid":"JzoxrA","address":{"address1":"850 Veterans Blvd #305","address2":null,"city":"Redwood City","state_prov":"California","postal_code":"94063","country":"US"}},{"company_name":"ueno.","description":"","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Front-End Developer","url":"http://codepen.io/url/job/rkAVLz","hashid":"OkPjxA","address":{"address1":"Sudurlandsbraut 6","address2":null,"city":"Reykjavik","state_prov":"ISL","postal_code":"108","country":"IS"}},{"company_name":"ueno.","description":"","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Senior Front-End Developer","url":"http://codepen.io/url/job/rEaEWr","hashid":"OAgRBz","address":{"address1":"1263 Mission Street\r\n3rd floor","address2":null,"city":"San Francisco","state_prov":"California","postal_code":"94103","country":"US"}},{"company_name":"RiskMatch, Inc.","description":"","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"UI Prototype Developer","url":"http://codepen.io/url/job/ndyaKz","hashid":"ozGeME","address":{"address1":"5 Greenwich Office Park, 4th Floor","address2":null,"city":"Greenwich","state_prov":"CT","postal_code":"06831","country":"US"}},{"company_name":"WHQ","description":"You’re always looking at new technologies and you push to innovate. <a href=\"http://www.worldhqinc.com\">WHQ</a> is where you need to be. We’re a team of designers, developers, and strategists who work on web, mobile, environmental and brand projects. Tough problems demand big ideas. We think quickly and are always looking for ways to push our clients and ourselves. Think you'd fit in? Read on.\r\n\r\n## Responsibilities\r\n- Write solid HTML, CSS and JavaScript for web sites and applications.\r\n- Build responsive web sites that function perfectly on any device or browser size.\r\n- Perform cross-browser compatibility tests and iterate to work through bugs.\r\n- Jump into existing Angular and React applications, or start them from the ground up.\r\n- Work with back-end developer to integrate sites with technologies such as WordPress, Drupal and Laravel.\r\n- Learn new technologies and share ideas.\r\n\r\n## Qualifications\r\n- Expert skills in HTML, CSS and JavaScript.\r\n- Experience with Angular, React, or other JavaScript frameworks.\r\n- Experience will Less or Sass\r\n- Solid command of responsive layouts.\r\n- Experience with Git and version control tools.\r\n- Testing experience is a plus\r\n- 3+ years within the industry.\r\n\r\n*Note: Must be able to work on site full-time in Chicago, IL.\r\n\r\nIf interested, please send your resume and Github profile link to <a href=\"mailto:jennifer@worldhqinc.com\">jennifer@worldhqinc.com</a>.","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Front End Developer","url":"http://codepen.io/url/job/ravMLn","hashid":"nAmwjk","address":{"address1":"","address2":null,"city":"Chicago","state_prov":"IL","postal_code":"60647","country":"US"}},{"company_name":"Rooster Grin","description":"<h3> About the position </h3>\r\n\r\nRooster Grin is hiring a full-time front-end, WordPress developer.  All applicants must have experience HTML, CSS, WordPress, and Java Script.  In addition, applicants will need in-depth knowledge of Photoshop and Illustrator with significant graphic design experience. Back end programming experience is a plus.  </br>\r\nThis is a client facing position, so strong communication skills and the ability to adhere to deadlines are very important.  In addition, the right applicant will be comfortable interfacing with clients to complete projects with minimal oversight.  </br>\r\n\r\n<h3> Skills </h3>\r\n We pride ourselves on taking a photo-journalistic approach to web design, where we emphasize photos and videos to make a strong first impression.  As a result, an applicant will be expected to design websites in Photoshop and then code the websites in WordPress.  This will require the ability to manage clients effectively while adhering to deadlines on several projects simultaneously.  With every new project, there is the opportunity to innovate a design unique and interesting websites for our clients.  </br>\r\nRooster Grin is a young, fast-paced, growing company. In addition to significant technical and graphic design skills, a successful member of Rooster Grin must have the following skills:</br>\r\n<ul>\r\n<li>Ability to manage multiple clients and projects simultaneously</li>\r\n<li>Strong Design Background</li>\r\n<li>Strong HTML, CSS  and JavaScript Background</li>\r\n<li>Deliver high-quality work in a timely manner</li>\r\n<li>Work well under pressure and complete projects according to deadlines</li>\r\n<li>Self-motivated and  able to complete projects with minimal guidance</li>\r\n<li>Participate in the sales process</li>\r\n</ul>\r\n<h3>About Rooster Grin </h3>\r\nRooster Grin Media was founded on the concept that we can become a competitive advantage for our clients. We specialize in Web Design, Web Hosting and Search Engine Optimization.</br>\r\nRooster Grin is a small, close-knit team of motivated, entrepreneurial individuals. We work as a team to deliver a great quality product to our clients. We believe that young companies are not for everyone. We work long hours, but have fun. There is less structure in place than you will find at a large company, but we see that as opportunity.\r\n\r\nPlease send all resumes to <a href=\"mailto:info@roostergrin.com?Subject=CodePen\"> info@roostergrin.com </a>\r\n\r\nCheck out our website: <a href=\"http://www.roostergrin.com\"> roostergrin.com </a>\r\n","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Front End Developer","url":"http://codepen.io/url/job/ZeNxer","hashid":"WARgJE","address":{"address1":"654A Natoma St","address2":null,"city":"San Francisco","state_prov":"CALIFORNIA","postal_code":"94103","country":"US"}},{"company_name":"Easygo Gaming Solutions","description":"*This job is available in house or remote.*\r\n\r\nApply by emailing Edward@easygo.io , cc: bijan@easygo.io\r\n\r\n###About [Easygo](http://easygo.io) \r\n\r\nEasygo Solutions is a brand new, heavily funded, software development company focusing on the online & physical casino/gaming market. \r\n\r\nWe are situated in the heart of Melbourne and boast a luxurious work environment with some amazing amenities. We are strictly looking for laid back yet motivated individuals to help us advance the many projects we are preparing to roll out. \r\n\r\nThe experience alone is something that you won't find anywhere else in Melbourne (or Australia); it's fast paced, challenging, open, agile & collaborative. If you think it's something you'd both really enjoy and excel at, then read on!\r\n\r\n###Job Description\r\n\r\nWe are looking for a great JavaScript developer who is proficient with React.js and strong with Javascript / CSS animations. Your primary focus will be on developing user interface components and implementing them with scalable state management architectures such as Redux / Mobx. You will ensure that these components are easy to maintain and are performant to deliver best user experience possible. You must be excited to work in the game industry and passionate about front-end and it's latest trends.\r\n\r\n###Technical Skills\r\n\r\n**Necessary**\r\n\r\n- Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\r\n- Thorough understanding of React.js and its core principles\r\n- Experience with scalable state management architectures (Redux / Mobx)\r\n- Experience with front-end routing (React-router)\r\n- Familiarity with RESTful APIs\r\n- Knowledge of EcmaScript 6 (ES6)\r\n- Experience with common front-end development tools such as Babel, Webpack, NPM, etc.\r\n- Familiarity with GIT\r\n\r\n**Bonus**\r\n\r\n- Experience with Canvas, WebGL or Javascript games\r\n- Experience with data structure libraries (e.g., Immutable.js)\r\n- Experience with type checkers (e.g., Flow, Typescript)\r\n- Experience with unit testing frameworks (e.g., Jest, Enzyme)\r\n \r\n\r\n**Soft Skills**\r\n\r\n- Strong ability to work unsupervised, we don't to micro manage. \r\n- Team player with a strong work ethic\r\n- Attention to detail (SUPER important for Front End dev work)\r\n- You have to be a little OCD - all our front end stuff is light, clean & you need to be able to maintain that\r\n \r\n\r\n###Got what it takes?\r\n\r\nPlease forward your Resume and Cover letter to edward@easygo.io and cc: bijan@easygo.io\r\n\r\nPlease provide any design or web related projects you have been involved with along with your github if you have one. We are looking for an immediate start. Please note that only candidates with relevant skills and experience will be contacted. ","featured":true,"featured_text":"The evolution of gaming!","remote":true,"term":"Contract","title":"React/Redux developer w/ experience in animations (CSS/Canvas)","url":"http://codepen.io/url/job/rxkAPZ","hashid":"VzvXjE"},{"company_name":"Snakk Media Pty Limited","description":"## Creative Developer in Sydney, AUS\r\n\r\nDo you love to be involved in the creation of digital brand campaigns? We have a full time position for a mid-level Creative Developer to help craft beautiful brand experiences across mobile, tablet and other digital platforms. You will be responsible for bringing these experiences to life via code, and contribute in conceptual brainstorming sessions.\r\n\r\n### What will you be doing?\r\n\r\n- Working closely with the Creative Director, Art Directors, Designers, User Experience Designers and other Developers in a very flat structure to create HTML5 mobile creative executions for mobile landing pages and sites.\r\n- Defining the best way to technically and creatively achieve client outcomes using a mobile campaign.\r\n- Interpreting what User actions need to be recorded and measured during the advertising experience.\r\n- Creating HTML 5 Rich media mobile creative - standard through to highly complex ‘app like’ creative executions from creative brief, strategy, through to design and oversee the build.\r\n- Interpreting and understanding client’s brand and desired result, focusing on getting the right mix of solutions to meet these needs\r\n- Assisting in the creation of storyboards and mood board designs to clients.\r\n- Creating and mapping User Journeys consistent with the creative concepts and the main campaign KPI\r\n- Providing professional and exceptional client service in all interactions with clients.\r\n- Liaising and working closely with the Creative Director and Art Director to deliver exceptional quality digital creative campaigns.\r\n\r\n### Who are Snakk Media?\r\n\r\n[Snakk Media](http://www.snakkmedia.com/#what-we-do) is Australia’s leading mobile marketing solutions provider that works with media agencies, brands and publishers alike to deliver mobile campaigns with astonishing results. Snakk was one of the first public companies to become a purpose-driven B Corporation, and was ranked 62nd in the 2013 Deloitte APAC Tech Fast-500. \r\n\r\n### Who are Touch Create?\r\n\r\nTouch create is a smart-screen creative agency born from the internal creative department of Snakk Media, Touch Create launched as a separate business in mid 2015. We tell brand stories by constantly inspiring new ideas adopting new approaches and adapting to changing mobile technologies. At the heart of all we do is remaining focused and results-oriented to ensure successful execution of marketing campaigns in the mobile landscape. It is this approach that has ensured that we have been finalists for the Webby’s and AWARD in our first year of operation!\r\n\r\nSee our work at: [www.touchcreate.com.au](http://www.touchcreate.com.au)\r\n\r\nHead office is in Surry Hills, Sydney and we also have offices in New Zealand & Singapore.\r\n\r\n\r\n### The types of campaigns you’ll be working on will be:\r\n\r\n- Rich media, standard through to highly complex ‘app like’ creative executions\r\n- Mobile landing pages & sites\r\n- Anything else you can think of – lead the industry!\r\n\r\n\r\n### You’ll be technically savvy in:\r\n\r\n- HTML 5 mobile site and mobile rich media build\r\n- UX patterns\r\n- Typography\r\n- Responsive Design\r\n- Scoping work documents/briefs from a technical perspective \r\n- User flow prototyping where applicable\r\n- Wireframing\r\n\r\n### And you’ll need to be proficient in the following Design tools:\r\n\r\n- Photoshop/Sketch\r\n- Adobe Illustrator\r\n- Adobe Aftereffects (would be a bonus)\r\n\r\n### And be able to code in:\r\n\r\nHTML5, CSS3, JS, PHP, Celtra (preferable but not mandatory) \r\n\r\n### So... who are you?\r\n\r\n- Dynamic, ‘on it’\r\n- Confident \r\n- Passionate\r\n- Awesome team player\r\n- Loves working in a creative, relaxed company with very high creative standards\r\n\r\n### Interested?\r\n\r\nSend your resume to [careers@snakkmedia.com](mailto:careers@snakkmedia.com) or if you have any questions then give Irini Jordan, Head of Production a call on 0418 165 347 to find out more information.\r\n\r\nApplications close 31 October 2016.\r\n\r\n\r\n","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Creative Developer - Sydney, AUS","url":"http://codepen.io/url/job/nDaXEz","hashid":"rEYQaE","address":{"address1":"Level 2\r\n91 Campbell Street","address2":null,"city":"Surry Hills, Sydney","state_prov":"NSW","postal_code":"2010","country":"AU"}},{"company_name":"codeBOX, LLC","description":"","featured":false,"featured_text":null,"remote":true,"term":"Full Time","title":"Fun Compassionate Battle Hardened Senior Web Developer","url":"http://codepen.io/url/job/Zqbgxr","hashid":"DEVWQk"},{"company_name":"Trade Skips","description":"[Trade Skips](http://tradeskips.com) is a Waste Management & Technologies company and we are looking for a Front End Developer (all levels considered) to join our small in-house team to help us with our big plans to reshape the waste management industry.\r\n\r\nWe are based in Ramsbottom, Bury, UK and the position would be based on-site at our offices although remote working is possible from time to time.\r\n\r\nYou will be tasked with building and maintaining the front end of our small but growing suite of applications, from our internal management tools in our custom built CRM to customer facing report generation systems. The position offers you an opportunity to take a lead on the front end of our software and drive the development process, we are not afraid to try new techniques and technologies, welcoming any ideas and input you have.\r\n\r\nAlong side our applications we also build and produce physical products with integrated monitoring systems allowing us to test and prototype products using other forms of hardware (Raspberry Pi, Arduino), if that's your cup of tea!\r\n\r\nWe are looking for someone who is passionate about what they do with the drive to constantly learn and improve. You will need to be familiar with the latest techniques and technologies in web development. We work in all areas of the development stack allowing you to gain experience across the full development spectrum.\r\n\r\n\r\n###Working for us as a Front End Developer you'll be expected to have:\r\n- great experience with HTML, CSS, JS.\r\n- working knowledge of PHP.\r\n- experience using Vue.js, ideally, or experience with other JS frameworks (Angular, Ember etc).\r\n- a strong passion for the web.\r\n- a desire to learn and better yourself.\r\n\r\n###Be great if you have:\r\n- experience of the Laravel framework (we use 5.2/5.3).\r\n- experience with MySQL databases.\r\n- experience with task runners (Grunt/Gulp).\r\n- experience with version control (Github/Bitbucket/Beanstalk).\r\n\r\n\r\n\r\n##Benefits\r\nWe love to innovate and try out new technologies as well as push the boundaries, when you find something new to try out we will always endeavour to find you the time to give it a go and find a way to use it in production.\r\n\r\n- Salary based on experience\r\n- Paid holidays and public holidays\r\n- Mac/Windows laptop provided\r\n- Educational allowance\r\n- Free Tea & Coffee!\r\n\r\n\r\n\r\n##How to apply?\r\nSend us your credentials* to [sam.jones@tradeskips.com](mailto:sam.jones@tradeskips.com)\r\n\r\n*doesn't have to be a CV we like to see personal portfolios and websites as well but don't forget to say hi and leave your contact details.","featured":true,"featured_text":"Help us change an industry!","remote":false,"term":"Full Time","title":"Front End Developer","url":"http://codepen.io/url/job/ZLGqdz","hashid":"DkdRJA","address":{"address1":"Prospect House,\r\nWhalley Rd,\r\nRamsbottom,","address2":null,"city":"Bury","state_prov":"Lancashire, UK","postal_code":"BL0 0ED","country":"GB"}},{"company_name":"X-Team International","description":"","featured":false,"featured_text":null,"remote":true,"term":"Contract","title":"Frontend Developer","url":"http://codepen.io/url/job/nMwLmZ","hashid":"JAowoA"},{"company_name":"The Working Party","description":"We’re looking for a front-end developer to join our team of coffee-lovers in our West Melbourne office.\r\n\r\n[The Working Party](https://theworkingparty.com.au/) is a group of creative problem-solvers who work on interesting and challenging projects for a range of clients. We value constant learning, aesthetics, interaction and usability.\r\n\r\nFront-end developers at The Working Party work directly with front-end designers and user experience experts to create beautiful e-commerce experiences on the Shopify platform.\r\n\r\nWe value performant code, accessible HTML5, well-structured SCSS and humorous banter on Slack.\r\n\r\n## Core skills\r\n\r\n* You code clean, modern HTML5, CSS & JS (you know when to use a  vs a <a>)\r\n* You take pride in the readability & maintainability of your code\r\n* You understand and implement cross-browser compatibility\r\n* You strategically choose solutions that support efficiency in rendering, loading, and painting of the page on the full spectrum of devices and networks without sacrificing UX\r\n* You value design aesthetics while seeking opportunities to leverage new techniques\r\n\r\n## Other things about you\r\n\r\n* You live in Melbourne, Australia\r\n* You use Git\r\n* You have built something with React, Angular or Angular 2, or Ember (or something else)\r\n* You have experience retrieving and posting data via REST APIs\r\n* You take personal responsibility for your deadlines, code quality, and tasks\r\n* You can communicate your ideas clearly\r\n\r\n## Even more things that might be about you\r\n\r\n* You’re familiar with Django\r\n* You can write your JavaScript without using jQuery & friends\r\n* You contribute to open source projects, maintain a blog, Twitter account, or seek to contribute to the community in some way (not necessarily the tech community!)\r\n* You have a willingness to help coworkers with their JS issues and love to teach what you know\r\n\r\n### About The Working Party\r\n\r\nThe Working Party is a digital agency that work across the commercial, retail, financial and government sectors. We specialise in:\r\n\r\n* Building beautiful eCommerce Web sites for clients in the fashion and design space\r\n* Providing UX, design and front end development services for large projects across various sectors\r\n* We place an emphasis on learning and non-client projects.\r\n\r\nWe offer a brand new working environment, MacBook Pro, Steelcase Gesture chairs, Lean Opendesks, a great team, and varied projects. \r\n\r\nPlease email your response to [work@theworkingparty.melbourne](mailto:work@theworkingparty.melbourne) and include a cover letter in addition to a resume & portfolio of your work / links to your best work and a description of your role in the project.\r\n\r\nNo recruiters no exceptions.\r\n","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Front End Developer","url":"http://codepen.io/url/job/ZogmdZ","hashid":"pALLDA","address":{"address1":"109 Hawke St","address2":null,"city":"West Melbourne","state_prov":"Vic","postal_code":"3003","country":"AU"}},{"company_name":"Stormpath, Inc.","description":"## Join a team where you can have an enormous impact!\r\n\r\nWe're looking for an experienced engineer at [Stormpath](https://stormpath.com/) with a sincere interest in giving back to the developer community.\r\n\r\nThe role is pretty awesome. You get to drive development on all our JS projects, including our Node.js SDK to our Angular and React integrations - with the goal of building great tools for the community to help them build better software, faster. Moreover, you'd get to engage directly with the community - teaching best practices, presenting at user groups, writing popular blog content, and contributing back to open source projects.\r\n\r\nStormpath is an authentication and user management REST API service that helps developers quickly and securely build web and mobile applications.\r\n\r\nWe hire smart, fun, humble, and passionate people who love what they do and deliver quality work. We're trying to achieve something great, with great people.\r\n\r\n## Apply\r\n\r\n[Here](https://boards.greenhouse.io/stormpath/jobs/254513#.V8X-pRMrLBI)","featured":false,"featured_text":null,"remote":false,"term":"Full Time","title":"Senior JS Engineer ","url":"http://codepen.io/url/job/ZJGxAr","hashid":"aAqjME","address":{"address1":"1825 S Grant St Ste 450","address2":null,"city":"San Mateo","state_prov":"California","postal_code":"94402","country":"US"}}]}